In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [ ]:
import pandas as pd

In [16]:
data = [4,8,15,16,23,42]
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [15]:
list= [1,2,"shaheem",2.5,True,3,5,{1,2,3},False,[1,2,3]]
ser2= pd.Series(list)
print(ser2)

0            1
1            2
2      shaheem
3          2.5
4         True
5            3
6            5
7    {1, 2, 3}
8        False
9    [1, 2, 3]
dtype: object

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [20]:
Data1 = {"Name": ["Alice", "Bob", "Claire"], "Age":[25,30,27], "Gender":["Female", "Male", "Female"]}
df = pd.DataFrame(Data1)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series?

In [ ]:
DataFrame in pandas is nothing but a tabular data with different rows and columns and designed for 
handling structured and tabular data. It is 2 dimenstional data stcuture.

Pandas Series is used to handle and represent single column of data. Hence it is one dimentional data structure
For Example:

In [26]:
#DataFrame
Data1 = {"Name": ["Alice", "Bob", "Claire"], "Age":[25,30,27], "Gender":["Female", "Male", "Female"]}
df = pd.DataFrame(Data1)
print(df)

#Pandas.Series

data = [4,8,15,16,23,42]
ser = pd.Series(data)
print("\n\n\n While \n\n\n", ser)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female



 While


 0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [27]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [28]:
df.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
df["Name"]

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [42]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [43]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
All Pandas data structures are value mutable (can be changed) and except Series all are size mutable
Series (in pandas) is size-immutable. That means, once a Series object is created, it cannot be changed. 
If we try to change it, it creates a new Series.
In Panel Data and size are mutable.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [46]:
d_name= pd.series[ "Shaheem", "Ajay", "Soni" ]
d_id= [ 1,2,3]
d_age= [20,21,21]
d_address= ["Mumbai","Pune","Lucknow"]

data2= {"Name": d_name, "ID": d_id, "Age": d_age, "Address": d_address}
data3 = pd.DataFrame(data2)
print(data3)

      Name  ID  Age  Address
0  Shaheem   1   20   Mumbai
1     Ajay   2   21     Pune
2     Soni   3   21  Lucknow